html/you_and_your_research.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-30 Thu 21:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>You and Your Research</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="preload" href="syntax.css" as="style" onload="this.onload=null;this.rel='stylesheet'">
<noscript><link rel="stylesheet" href="syntax.css"></noscript>
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<a style="color: inherit; text-decoration: none" href="/">
<h2>Ketan's Digital Laboratory &#129514;</h2>
</a>
</div>
<div id="content" class="content">
<h1 class="title">You and Your Research</h1>
<p>
related: <a href="research.html#ID-283dc18a-8b0e-4d9a-94c8-898c5ff04437">research</a><br />
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Richard_Hamming">Richard Hamming</a> gave a talk that's gained an increasing cult following in recent years. Drawing on his experience from Bell Labs, he lists some the characteristics of the top researchers there (including himself.)<br />
</p>

<div id="outline-container-ID-db60164d-58a3-461b-bd87-ef0706ef8e69" class="outline-2">
<h2 id="ID-db60164d-58a3-461b-bd87-ef0706ef8e69">Work with the door open.</h2>
<div class="outline-text-2" id="text-orgd4fd335">
<p>
Hamming noticed that working with the office door closed, while good for productivity in the short-term, ended up hurting researchers in the long run. If you don't "work with the door open," so to speak, you might miss the actual important problems.<br />
</p>
</div>
</div>
<div id="outline-container-ID-53453a99-5ee4-448a-b6af-2ead2d644809" class="outline-2">
<h2 id="ID-53453a99-5ee4-448a-b6af-2ead2d644809">Sometimes "faults," from another viewpoint, can actually be assets.</h2>
<div class="outline-text-2" id="text-orgbd22707">
<p>
Back in the day when machines were painstakingly programmed in binary, Bell Labs wouldn't give Hamming the personnel required to do that; while this could be seen as a "fault," it actually made him become one of the earliest adopters of automatic programming. Similar drives led <a href="https://en.wikipedia.org/wiki/Grace_Hopper">Grace Hopper</a> and others to invent high-level programming language.<br />
</p>
</div>
</div>
<div id="outline-container-ID-a9bda1cb-cae4-4bbc-95dd-a7cdbc197e29" class="outline-2">
<h2 id="ID-a9bda1cb-cae4-4bbc-95dd-a7cdbc197e29">Knowledge and productivity are like compound interest.</h2>
<div class="outline-text-2" id="text-orgb0d787d">
</div>
</div>
<div id="outline-container-ID-78cc0572-4853-483f-89c6-9ba20bd34c75" class="outline-2">
<h2 id="ID-78cc0572-4853-483f-89c6-9ba20bd34c75">Have courage to follow ideas.</h2>
<div class="outline-text-2" id="text-orgec9bb5e">
</div>
</div>
<div id="outline-container-ID-c454058f-bb1c-4dc7-952a-4f7fae83e0d0" class="outline-2">
<h2 id="ID-c454058f-bb1c-4dc7-952a-4f7fae83e0d0">Work on important (but also actionable) problems.</h2>
<div class="outline-text-2" id="text-org21f9d5f">
</div>
</div>
<div id="outline-container-ID-0289232f-10bb-4b17-9a41-feff6c98dff0" class="outline-2">
<h2 id="ID-0289232f-10bb-4b17-9a41-feff6c98dff0">Have a "web" of 10-20 important problems you work on.</h2>
<div class="outline-text-2" id="text-orgb7b2884">
</div>
</div>
<div id="outline-container-ID-230a6748-ab6b-44d0-9336-de0a4af55225" class="outline-2">
<h2 id="ID-230a6748-ab6b-44d0-9336-de0a4af55225">You need contact hours with your work.</h2>
<div class="outline-text-2" id="text-orgba80273">
</div>
</div>
<div id="outline-container-ID-8a462063-27c7-4405-9714-39f22e388de8" class="outline-2">
<h2 id="ID-8a462063-27c7-4405-9714-39f22e388de8">Knowledge + productivity = compound interest.</h2>
<div class="outline-text-2" id="text-orgef7cd95">
</div>
</div>
<div id="outline-container-ID-1f27a891-eec3-4798-ac94-b8073283ad36" class="outline-2">
<h2 id="ID-1f27a891-eec3-4798-ac94-b8073283ad36">Tolerate ambiguity.</h2>
<div class="outline-text-2" id="text-org77fa11f">
</div>
</div>
<div id="outline-container-ID-267245a5-db4e-45ea-ab7f-9afc4e4ad6e0" class="outline-2">
<h2 id="ID-267245a5-db4e-45ea-ab7f-9afc4e4ad6e0">Complete emotional commitment to your work =&gt; subconscious keeps churning</h2>
<div class="outline-text-2" id="text-org79a042a">
</div>
</div>
<div id="outline-container-ID-0c3d22ae-f83c-4aa7-a603-f593892d1217" class="outline-2">
<h2 id="ID-0c3d22ae-f83c-4aa7-a603-f593892d1217">Don't get angry; instead be amused</h2>
<div class="outline-text-2" id="text-orgaf93ced">
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Made with <span class="heart">♥</span> using
<a href="https://orgmode.org/">org-mode</a>.
Source code is available
<a href="https://github.com/ketan0/digital-laboratory">here</a>.</p>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js" async></script>
</div>
</body>
</html>
